app/controllers/dishes_controller.rb

  def search

    @locations = []

    gon.locations = @locations

    @dishes_search = Dish.where('name LIKE ?',"%#{params[:name]}%")

    @dishes_search.find_each do |dish|
---
SELECT  `dishes`.* FROM `dishes` WHERE (name LIKE '%%') ORDER BY `dishes`.`id` ASC LIMIT 1000